tap "cjbassi/gotop"
tap "d12frosted/emacs-plus"
tap "golangci/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# TAP-compliant test framework for Bash scripts
brew "bats"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# Message bus system, providing inter-application communication
brew "dbus"
# Load/unload environment variables based on $PWD
brew "direnv"
# Programming language for highly scalable real-time systems
brew "erlang"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Remote repository management made easy
brew "ghq"
# Add GitHub support to git on the command-line
brew "hub"
# Spell checker and morphological analyzer
brew "hunspell"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# LastPass command-line interface tool
brew "lastpass-cli"
# Next-gen compiler infrastructure
brew "llvm"
# Powerful, lightweight programming language
brew "lua"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Simplistic interactive filtering tool
brew "peco"
# Manage compile and link flags for libraries
brew "pkg-config"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Run scalastyle from the command-line
brew "scalastyle"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# The cross-shell prompt for astronauts
brew "starship"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Command-line translator using Google Translate and more
brew "translate-shell"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# JavaScript package manager
brew "yarn", args: ["--ignore-dependencies"]
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# A terminal based graphical activity monitor inspired by gtop and vtop
brew "cjbassi/gotop/gotop"
# GNU Emacs text editor
brew "d12frosted/emacs-plus/emacs-plus", args: ["with-dbus", "without-spacemacs-icon"]
# Fast linters runner for Go.
brew "golangci/tap/golangci-lint"
cask "appcleaner"
cask "cyberduck"
cask "dbeaver-community"
cask "docker"
cask "dropbox"
cask "firefox"
cask "font-source-code-pro"
cask "fork"
cask "franz"
cask "google-chrome"
cask "google-chrome-canary"
cask "google-japanese-ime"
cask "iterm2"
cask "java"
cask "postman"
cask "sequel-pro"
cask "spotify"
cask "visual-studio-code"
mas "Amphetamine", id: 937984704
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "iThoughtsX", id: 720669838
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
